//Count Odd Numbers below n
//Посчитать количество нечетных чисел до n
//В аргумент будет приходить число
//Должны посчитать количество нечетных чисел

function oddCount(n){
   return Math.floor(n/2);
  }


  //Первый вариант сделать цикл и проверять четное или не четное
  //Сделать цикл от 1 до этого числа и проверять четное или не четное
  //Если число не четное то увеличивать счетчик

  //Постичать количество не четных чисел до n
  //Предствим что n = 7 
  //Не четные числа это 1 3 5
  //Как это можно вывести нужно поделить искомое число на 2
  //И окгуглить вниз - Math.floor
  // 7 делим на 2 --> 3.5 